``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_blockstorage_volume_v2.dokku-data will be created
  + resource "openstack_blockstorage_volume_v2" "dokku-data" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for dokku"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "stats"
      + region            = (known after apply)
      + size              = 50
      + volume_type       = (known after apply)
    }

  # openstack_compute_volume_attach_v2.dokku-va will be created
  + resource "openstack_compute_volume_attach_v2" "dokku-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = "030ea6f7-ad95-441f-8cdc-89ff10af062e"
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```